def get_name():
    return input('Введите имя: ')

def get_sename():
    return input('Введите фамилию: ')\

def get_lesson():
    return input('Введите название предмета: ')

def get_grade():
    return int(input('Введите оценку предмета:'))

def actions():
    return int(input('Выберите действие:\n1.Добавить ученика\n2.Добавить предмет\n3.Добавить оценку\n4.Показать список учеников\n5.Показать оценки ученика\n6.Сгенерировать 100 сулчайных учеников\n7.Средний бал ученика по предмету\n8.Средний бал по предмету в школе\n9.Вывод отличников\n0.Выход\nДействие:'))